const environmentMap = new URL('/environmentMap', import.meta.url).href + "/"

export const ENVIROMENT_MAP = {
    '0': {
        'ID': 0,
        'NAME': 'environment',
        'type': 'cubeTexture',
        'texture':
            [
                `${environmentMap}px.jpg`,
                `${environmentMap}nx.jpg`,
                `${environmentMap}py.jpg`,
                `${environmentMap}ny.jpg`,
                `${environmentMap}pz.jpg`,
                `${environmentMap}nz.jpg`
            ]
    },
};

export const rooms_mok = [
    {
        id: 0,
        label: "Гостинная",
        description: "Гостевая комната",
        size: {
            walls: [
                {
                    "width": 2747.411223548689,
                    "height": 3000,
                    "depth": 4000,
                    "position": {
                        "x": -1663.0922903659855,
                        "y": 1500,
                        "z": 2710.090083570047
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": 2.3675439830617764,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                },
                {
                    "width": 4392.303869395567,
                    "height": 3000,
                    "position": {
                        "x": -2645.410451379374,
                        "y": 1500,
                        "z": -446.3316769390029
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": 1.5707963267948966,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                },
                {
                    "width": 2272.8599797808804,
                    "height": 3000,
                    "position": {
                        "x": -1829.2715216533568,
                        "y": 1500,
                        "z": -3433.29987936783
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": 0.7696413045200817,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                },
                {
                    "width": 2576.171186582587,
                    "height": 3000,
                    "position": {
                        "x": 274.95300136395384,
                        "y": 1500,
                        "z": -4224.116147098873
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": 0,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                },
                {
                    "width": 2049.5018888203016,
                    "height": 3000,
                    "position": {
                        "x": 2045.1205420016008,
                        "y": 1500,
                        "z": -3319.84213214973
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": -1.0810090797100627,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                },
                {
                    "width": 4831.299114490155,
                    "height": 3000,
                    "position": {
                        "x": 2527.202489347954,
                        "y": 1500,
                        "z": 0.00008144004449128772
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": -1.5707963267948966,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                },
                {
                    "width": 1549.7921222156,
                    "height": 3000,
                    "position": {
                        "x": 2025.923332417739,
                        "y": 1500,
                        "z": 3006.6481762137522
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": -2.274306673787386,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                },
                {
                    "width": 2206.619347882946,
                    "height": 3000,
                    "position": {
                        "x": 421.93502306746317,
                        "y": 1500,
                        "z": 3633.9626322596246
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": -3.108597490953583,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                }
            ],
            wall: '44163',
            floor: '44025'
        },
        content: [
            {
                "id": 166755,
                "position": {
                    "x": -650.4104513793745,
                    "y": 1499.9990000000005,
                    "z": 1570.8830412339005
                },
                "rotation": {
                    "isEuler": true,
                    "_x": 0,
                    "_y": 1.5707963267948966,
                    "_z": 0,
                    "_order": "XYZ"
                },
                "size": {
                    "width": 100,
                    "height": 3000,
                    "depth": 4000
                }
            },
            {
                "id": 3965019,
                "position": {
                    "x": -2370.4176931049014,
                    "y": 279.9917556705615,
                    "z": -2053.371267532848
                },
                "rotation": {
                    "isEuler": true,
                    "_x": 0,
                    "_y": 1.5707963267948966,
                    "_z": 0,
                    "_order": "XYZ"
                }
            },
            {
                "id": 3965002,
                "position": {
                    "x": 258.88907466986524,
                    "y": 1062.7716454366998,
                    "z": -3948.17315393481
                },
                "rotation": {
                    "isEuler": true,
                    "_x": 0,
                    "_y": 0,
                    "_z": 0,
                    "_order": "XYZ"
                }
            },
            {
                "id": 3689611,
                "position": {
                    "x": -1714.3351745901696,
                    "y": 1040.4584595432282,
                    "z": 2536.8184982182934
                },
                "rotation": {
                    "isEuler": true,
                    "_x": 0,
                    "_y": 2.3675439830617764,
                    "_z": 0,
                    "_order": "XYZ"
                }
            },
            {
                "id": 3689572,
                "position": {
                    "x": 255.4316635402363,
                    "y": 400.1923288574219,
                    "z": -3779.1161470988727
                },
                "rotation": {
                    "isEuler": true,
                    "_x": 0,
                    "_y": 0,
                    "_z": 0,
                    "_order": "XYZ"
                }
            },
            {
                "id": 3967382,
                "position": {
                    "x": -1286.2505923939332,
                    "y": 499.9925626983643,
                    "z": -3583.5166072552342
                },
                "rotation": {
                    "isEuler": true,
                    "_x": 0,
                    "_y": 0.7696413045200817,
                    "_z": 0,
                    "_order": "XYZ"
                }
            },
            {
                "id": 3967391,
                "position": {
                    "x": 1932.2102141099167,
                    "y": 399.9938163036891,
                    "z": -876.8661362940093
                },
                "rotation": {
                    "isEuler": true,
                    "_x": 0,
                    "_y": -1.5707963267948966,
                    "_z": 0,
                    "_order": "XYZ"
                }

            },
            {
                "id": 3972187,
                "position": {
                    "x": 2507.2024899440003,
                    "y": 1382.7746387653303,
                    "z": -919.4989865604222
                },
                "rotation": {
                    "isEuler": true,
                    "_x": 0,
                    "_y": -1.5707963267948966,
                    "_z": 0,
                    "_order": "XYZ"
                }

            },
            {
                "id": 3689569,
                "position": {
                    "x": 344.7297702412294,
                    "y": 1176.789956549328,
                    "z": 3541.460081855053
                },
                "rotation": {
                    "isEuler": true,
                    "_x": 0,
                    "_y": -3.108597490953583,
                    "_z": 0,
                    "_order": "XYZ"
                }

            },
            {
                "id": 3689538,
                "position": {
                    "x": -2230.0057272582803,
                    "y": 371.50925390625,
                    "z": -527.3590814395476
                },
                "rotation": {
                    "isEuler": true,
                    "_x": 0,
                    "_y": 1.5707963267948966,
                    "_z": 0,
                    "_order": "XYZ"
                }

            },
            {
                "id": 3689544,
                "position": {
                    "x": 265.1785978632719,
                    "y": 517.5508667846918,
                    "z": -3314.8436246057813
                },
                "rotation": {
                    "isEuler": true,
                    "_x": 0,
                    "_y": -3.108597490953583,
                    "_z": 0,
                    "_order": "XYZ"
                }
            },
            {
                "id": 3967382,
                "position": {
                    "x": -2375.41399952457,
                    "y": 499.9925626983643,
                    "z": 1009.5613709251252
                },
                "rotation": {
                    "isEuler": true,
                    "_x": 0,
                    "_y": 1.5707963267948966,
                    "_z": 0,
                    "_order": "XYZ"
                }
            }
        ]
    },
    {
        id: 1,
        label: "Кухня",
        description: "Современная кухня",
        size: {
            walls: [
                {
                    "width": 4663.648412392543,
                    "height": 3000,
                    "position": {
                        "x": -110.58992514880028,
                        "y": 1500,
                        "z": 3122.47870172862
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": 3.141592653589793,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                },
                {
                    "width": 5970.388780100474,
                    "height": 3000,
                    "position": {
                        "x": -2442.414131345071,
                        "y": 1500,
                        "z": 137.28431167838284
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": 1.5707963267948966,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                },
                {
                    "width": 4688.847858299175,
                    "height": 3000,
                    "position": {
                        "x": -97.99020219548371,
                        "y": 1500,
                        "z": -2847.910078371854
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": 0,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                },
                {
                    "width": 1178.5531897591726,
                    "height": 3000,
                    "position": {
                        "x": 2482.4841930446704,
                        "y": 1500,
                        "z": -2307.977598582662
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": -1.1586501771882085,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                },
                {
                    "width": 3836.990567466234,
                    "height": 3000,
                    "position": {
                        "x": 2718.534659135238,
                        "y": 1500,
                        "z": 150.45016493964702
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": -1.5707963267948966,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                },
                {
                    "width": 1165.0064297422098,
                    "height": 3000,
                    "position": {
                        "x": 2469.8844700913547,
                        "y": 1500,
                        "z": 2595.712075200692
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": -2.0118194577721136,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                }
            ],
            wall: '44144',
            floor: '44020'
        },
        content: [
        ],
    },
    {
        id: 2,
        label: "Спальня",
        description: "Лучшая спальня с гигантской кроватью",
        table_color: '',
        size: {
            walls: [
                {
                    "width": 1044.8444795442065,
                    "height": 3000,
                    "position": {
                        "x": -1669.4874813187104,
                        "y": 1500,
                        "z": 3093.949082691206
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": 2.2478390629000566,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                },
                {
                    "width": 5340.084268995384,
                    "height": 3000,
                    "position": {
                        "x": -1996.7802030892923,
                        "y": 1500,
                        "z": 16.7159968150421
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": 1.5707963267948966,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                },
                {
                    "width": 1259.2169409291123,
                    "height": 3000,
                    "position": {
                        "x": -1516.2575550813289,
                        "y": 1500,
                        "z": -3060.148962548872
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": 0.7025318464105211,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                },
                {
                    "width": 3260.3833703379586,
                    "height": 3000,
                    "position": {
                        "x": 454.8986114924767,
                        "y": 1500,
                        "z": -2807.0197863407023
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": -0.4167939141392737,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                },
                {
                    "width": 3650.7533465790813,
                    "height": 3000,
                    "position": {
                        "x": 1945.5321300583188,
                        "y": 1500,
                        "z": -321.69111197677025
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": -1.5707963267948966,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                },
                {
                    "width": 1284.5041505929815,
                    "height": 3000,
                    "position": {
                        "x": 1303.2800547618284,
                        "y": 1500,
                        "z": 1503.6855613127704
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": 3.141592653589793,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                },
                {
                    "width": 2214.437794775425,
                    "height": 3000,
                    "position": {
                        "x": 149.53904417320918,
                        "y": 1500,
                        "z": 2485.6798361464816
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": -2.0509982579981836,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                },
                {
                    "width": 980.8159715716447,
                    "height": 3000,
                    "position": {
                        "x": -852.0723253335238,
                        "y": 1500,
                        "z": 3484.4070725249354
                    },
                    "rotation": {
                        "isEuler": true,
                        "_x": 0,
                        "_y": -3.1074655379912755,
                        "_z": 0,
                        "_order": "XYZ"
                    },
                    "side": 0
                }
            ],
            wall: '44176',
            floor: '44032'
        },
        content: [
        ],
    },
];
